Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/udir.no.csv-en-nn.deduped.tmx
Source language: en
Languages: nn

source: The teacher shall facilitate for pupil participation and stimulate the desire to learn by allowing the pupils to explore mathematics and solve mathematical problems by being creative, modelling and reflecting.
nn: Læraren skal leggje til rette for elevmedverknad og stimulere til lærelyst ved at elevane får utforske matematikk og løyse matematiske problem gjennom å vere kreative, modellere og reflektere.

source: The teacher and pupils shall engage in dialogue about their development of numeracy and understanding of numbers.
nn: Læraren skal vere i dialog med elevane om utviklinga deira i rekning og talforståing.

source: Teaching shall also arrange for the work to be done in line with current legislation for environment, health and safety.
nn: Aktivitøren skal kunne leie og rettleie frivillige lag, organisasjonar og pårørande som ønskjer å delta i aktivitetar.

source: development of a good learning environment.
nn: svekkje sjølvbiletet til den enkelte og hindre utvikling av eit godt læringsmiljø.

source: explore, use and describe different strategies for division explore and explain the relationships between the four arithmetical
nn: utforske, bruke og beskrive ulike divisjonsstrategiar utforske og forklare samanhengar mellom dei fire rekneartane og

source: choose a theme, formulate questions and illuminate these by using different sources
nn: velje eit tema, forme spørsmål og kaste lys over dei ved å bruke ulike kjelder

source: use and provide rationale for congruence, scales and the Pythagorean theorem for calculations and in practical work
nn: bruke formlikskap og Pytagoras’ setning til berekningar og i praktisk arbeid

source: expressions and practical activities.
nn: estetiske uttrykksformer og praktiske aktivitetar.

source: in Mathematics involves understanding and using symbolic language and forms of expression to create meaning from texts in day-to-day life, working life and from mathematics texts.
nn: i matematikk inneber å tolke og dra nytte av tekstar med matematisk innhald og med innhald frå daglegliv og yrkesliv.

source: plan and present trips to Europe and other regions of the world using digital tools
nn: planleggje og presentere reiser til Europa og andre verdsdelar ved å bruke digitale verktøy

source: in social studies means to read, examine, interpret and reflect on factual prose texts and fiction containing increasing levels of difficulty in order to experience contact with other periods, places and people.
nn: i samfunnsfag inneber å setje seg inn i, granske, tolke og reflektere over faglege tekstar og skjønnlitteratur med stigande vanskegrad for å oppleve kontakt med andre tider, stader og menneske.

source: Geography has competence aims after Vg1 in the programme area for science and languages, social sciences and economics in programmes for specialisation in general studies.
nn: Geografi har kompetansemål etter Vg1 i programområde for realfag og språk, samfunnsfag og økonomi i studiespesialiserande utdanningsprogram.

source: The goats would not just be rescued.
nn: Geitene skal ikkje berre reddast.

source: measure the radius, diameter and circumference of circles, and explore
nn: beskrive eigenskapar ved og minimumsdefinisjonar av to- og

source: read and analyse texts in Bokmål and Nynorsk in different genres in order to form an opinion on the issues they raise and the values they represent
nn: lese og analysere tekstar på nynorsk og bokmål i ulike sjangrar, og ta stilling til spørsmål tekstane tek opp, og verdiar dei representerer

source: represent and use fractions, decimal numbers and percentages in
nn: representere og bruke brøk, desimaltal og prosent på ulike måtar og

source: The teacher and pupils shall engage in dialogue about their development in natural science.
nn: Læraren og elevane skal vere i dialog om utviklinga til elevane i naturfag.

source: It also deals with Sámi legal opinion in this area.
nn: Det handlar òg om samisk rettsoppfatning på dette området.

source: technology and design
nn: aktivitet og livsstil

source: use sources in a critical and verifiable way and master digital citation
nn: bruke kjelder på ein kritisk og etterprøvbar måte og meistre digital kjeldetilvising

source: It covers the use of animations and simulations to illustrate and explain scientific material.
nn: Det omfattar å bruke animasjonar og simuleringar til å illustrere og utdjupe biologifagleg stoff.

source: The pupils demonstrate and develop their competence in social science when they show that they can reflect on the conditions in society, and critically assess and discuss different contexts and perspectives.
nn: Elevane viser og utviklar kompetanse i samfunnskunnskap når dei reflekterer over forhold i samfunnet og kritisk vurderer og diskuterer ulike samanhengar og perspektiv.

source: An assessment often results in a decision, a judgement or a conclusion.
nn: Å utforske kan bety å sanse, søke, oppdage, observere og granske.

source: The pupils demonstrate and develop competence in the subject in year 8 when they explore and generalise about mathematical relationships algebraically.
nn: Elevane viser og utviklar kompetanse i faget på 8. trinn når dei utforskar og generaliserer matematiske samanhengar algebraisk.

source: The subject shall stimulate the development of knowledge on cultural diversity in the world in the past and the present, and an understanding of the relation between nature and man-made environments.
nn: Faget skal stimulere til utvikling av kunnskap om det kulturelle mangfaldet i verda i fortida og samtida, og til forståing av forholdet mellom naturen og dei menneskeskapte omgjevnadene.

source: The main area food and consumption refers to learning about different foods, food labelling and production, and about learning to be critical and responsible consumers.
nn: handlar om å bli kjend med ulike matvarer, varemerking og produksjon, og om mennesket som kritisk og ansvarleg forbrukar.

source: subject-related knowledge and rhetorical skills in discussions and presentations
nn: fagkunnskap og retoriske ferdigheiter i norskfaglege diskusjonar og presentasjonar

source: use digital tools to find information on the scope of crime in Norway, provide grounds why the community punishes lawbreakers and explain how crime may be prevented
nn: bruke digitale verktøy til å finne informasjon om omfanget av kriminalitet i Noreg, grunngje kvifor samfunnet straffar og gjere greie for korleis kriminalitet kan førebyggjast

source: explore, describe and argue for relationships between the length of the
nn: utforske, beskrive og argumentere for samanhengar mellom

source: listen to and process input from others while distinguishing between opinion and fact
nn: lytte til og vidareutvikle innspel frå andre og skilje mellom meiningar og fakta

source: Both being able to use and to evaluate aids and technology and recognising their limitations are important aspects of the subject.
nn: Både det å kunne bruke og vurdere hjelpemiddel og teknologi og det å kjenne til avgrensinga deira er viktige delar av faget.

source: With numbers it is possible to quantify amounts and magnitudes.
nn: Med tal kan ein kvantifisere mengder og storleikar.

source: But it does occur’, states Lone Svinth.
nn: Men han skjer, fortel Lone Svinth.

source: represent fractions in different ways and switch between the different
nn: representere brøkar på ulike måtar og omsetje mellom dei ulike

source: Geography shall also create understanding of why resources are important for global production, division of labour and settlement.
nn: Geografi skal og skape forståing for kvifor ressursane er viktige for den globale produksjonen, arbeidsdelinga og busetnaden.

source: elaborate on imperialism and provide examples of de-colonisation
nn: gjere greie for kolonialisme og imperialisme og gje døme på avkolonisering

source: on how texts from the romantic and romantic nationalist periods present people, nature and society and
nn: over korleis tekstar frå romantikken og nasjonalromantikken framstiller menneske, natur og samfunn, og

source: Assistants spend more than 80 per cent of their working hours with the children.
nn: Assistentar er saman med barna over 80 prosent av arbeidstida.

source: Children develop socially, emotionally and cognitively when they cooperate.
nn: Barn utviklar seg sosialt, emosjonelt og kognitivt når dei samarbeider.

source: explain the emergence of the welfare state and describe characteristics of modern Norway
nn: gjere greie for framveksten av velferdsstaten og beskrive trekk ved Noreg i dag

source: Good cooperation between school and
nn: Eit godt samarbeid mellom skole og arbeidsliv aukar

source: this with strategies for calculating with whole numbers
nn: med reknestrategiar for heile tal

source: That is why it is important to study the media analytically and critically.
nn: Difor er det viktig å studere media med analytisk og kritisk blikk.

source: It involves providing information about work and activation in a multidisciplinary team, and motivating and guiding clients in activation processes.
nn: Det inneber å informere om arbeid og aktivisering i tverrfaglege team og å motivere og rettleie brukarane i aktiviseringsprosessane.

source: Learning in the subject of Physical Education shall attend to traditional and alternative physical activities in the subject and stimulate experimentation and creative development.
nn: Opplæringa i kroppsøving skal ta vare på både tradisjonelle og alternative rørsleaktivitetar i faget og stimulere til eksperimentering og kreativ utfolding.

source: In a multicultural society, awareness of Norwegian food culture and the special features of Sami food tradition is important, as is also having knowledge about and respect for food traditions in other cultures.
nn: I eit fleirkulturelt samfunn er det viktig med medvit om norsk matkultur og det særeigne for samisk mattradisjon, og ha kunnskap om og respekt for mattradisjonar i andre kulturar.

source: explain what attitudes and prejudices are, and discuss and elaborate on opportunities and challenges in multicultural communities
nn: forklare kva haldningar og fordommar er og drøfte moglegheiter og utfordringar i fleirkulturelle samfunn

source: To understand and participate actively in the society we live in, it is also necessary to be able to read and collect information from reference books, newspapers and the internet, and to assess this information critically.
nn: For å forstå og delta aktivt i samfunnet ein lever i, er det òg nødvendig å kunne lese og samle informasjon frå oppslagsverk, aviser og Internett og vurdere dette kritisk.

source: This also includes interpreting maps and understanding symbols.
nn: Det handlar òg om å tolke kart og forstå symbol.

source: present important demographic changes and assess the causes of
nn: utforske folks handlingsrom og valmoglegheiter i konfliktsituasjonar og

source: To describe something may also refer to using relevant terminology to systematise knowledge of a topic.
nn: Å beskrive noko kan òg vere å bruke relevante fagomgrep for å systematisere kunnskap om emnet.

source: explore mathematical properties and relationships by means of
nn: utforske matematiske eigenskapar og samanhengar ved å bruke

source: write narrative, descriptive, reflective and persuasive texts using patterns from sample texts and other sources, and adapt own texts to a given purpose and recipient
nn: skrive forteljande, skildrande, reflekterande og argumenterande tekstar etter mønster av eksempeltekstar og andre kjelder, og tilpasse eigne tekstar til føremålet og mottakaren

source: How, then, can it be that we have not done that already?
nn: Men korleis kan det eigentleg ha seg at vi ikkje allereie gjer det?

source: Physical activity in various environments and settings
nn: aktivitet i ulike rørslemiljø

source: The values in the objectives clause
nn: verdiar og samisk språk, kultur og samfunnsliv.

source: on how texts from realism and modernism traditions present humankind, nature and society
nn: over korleis tekstar frå den realistiske og den modernistiske tradisjonen framstiller menneske, natur og samfunn

source: explain the rights of children and the different expectations girls and boys meet in everyday life, and converse about how expectation can be experienced
nn: gje døme på rettar barn har, og ulike forventningar jenter og gutar møter i kvardagen, og samtale om korleis forventningane kan opplevast

source: hand tools and joining techniques for wood, clay and textiles in a safe and environmentally friendly way
nn: handverktøy og samanføyingsteknikkar i tre, leire og tekstil på ein miljømedviten og trygg måte

source: To explore may mean to sense, seek, discover, observe and examine.
nn: Å utforske kan bety å sanse, søke, oppdage, observere og granske.

source: This article is not based on research on the NB-ECEC database like the other articles in this magazine.
nn: Denne artikkelen byggjer ikkje på forsking i databasen NB-ECEC, slik som dei andre artiklane i magasinet gjer.

source: elaborate on political institutions in Norway and compare them with institutions in other countries
nn: gjere greie for politiske institusjonar i Noreg og samanlikne dei med institusjonar i andre land

source: Cekaite and Holm Kvist had observed that children often were crying in the kindergarten.
nn: Cekaite og Holm Kvist hadde lagt merke til at det ofte var barn i barnehagen som græt.

source: The subject area also covers the structure and reproduction of bacteria and viruses.
nn: Området omfattar i tillegg oppbygginga og formeiringa til bakteriar og virus.

source: This main subject area covers the multicultural society and the role of religion in culture.
nn: Hovudområdet omfattar fleirkulturelle samfunn og religionen si rolle i kulturen.

source: discuss the concepts economic growth, standard of living, quality of life and sustainable development and the relationship between these
nn: diskutere omgrepa økonomisk vekst, levestandard, livskvalitet og berekraftig utvikling og forholdet mellom dei

source: test and describe characteristics of materials used in a production process
nn: vurdere forbruk og setje opp budsjett og rekneskap ved hjelp av rekneark (matematikk)

source: The teaching and training shall give the pupils knowledge and skills to face challenges in
nn: Opplæringa skal gi elevane kunnskapar og ferdigheiter til å møte utfordringar i tråd med

source: create stories about people from different societies in the past and present and show how their living conditions and values influenced their thoughts and actions
nn: skape forteljingar om menneske frå ulike samfunn i fortid og notid og vise korleis livsvilkår og verdiar påverkar tankar og handlingar

source: School must provide room for in-depth learning so that the pupils develop understanding of
nn: Skolen skal gi rom for djupnelæring slik at elevane utviklar forståing av sentrale element og

source: strategies for calculating with decimal numbers and
nn: strategiar for rekning med desimaltal og

source: Numbers include whole numbers, fractions, decimal numbers and percentages.
nn: Tal omfattar både heile tal, brøk, desimaltal og prosent.

source: give an account of political institutions in Norway and compare them with institutions in other countries
nn: gjere greie for politiske institusjonar i Noreg og deira rollefordeling og samanlikne dei med institusjonar i andre land

source: This main subject area also examines contemporary working life and the principles and values it is based on.
nn: Hovudområdet handlar også om arbeidslivet i dag og dei prinsipp og verdiar det byggjer på.

source: similarity and congruence
nn: formlikskap og kongruens

source: describe strategies in multiplication
nn: utforske og beskrive strategiar i multiplikasjon

source: On the contrary, they envisage a traditional school where the teachers are strict, where the older children tease the younger ones, and where school work is monotonous.
nn: Dei ser snarare for seg den tradisjonelle skolen der lærarane er strenge, der dei store ertar dei små, og der skolearbeidet er einsformig.

source: 35% of the children who knew the fewest amount of words – 300 children – were picked out to receive a systematic language stimulation.
nn: 35 prosent av barna som kunne færrast ord – 300 barn – blei valde ut til å få systematisk språkstim­ulering.

source: The interaction between cultural norms and societal control on the one hand and individual actions and choices on the other are key elements of this main subject area.
nn: Samspelet mellom kulturelle normer og samfunnsstyring på den eine sida og individuelle handlingar og val på den andre er sentralt i hovudområdet.

source: The main subject area focuses on the knowledge, experience and reflection required to carry out various types of exercise and self-training as the basis for an active lifestyle and taking one's own and others skills levels and aptitudes into consideration.
nn: Det skal òg leggjast vekt på kunnskap, erfaring og refleksjon for å gjennomføre ulike aktivitetsformer og eigentrening som grunnlag for ein aktiv livsstil, og ta omsyn til eigne og andre sine føresetnader.

source: In connection with meal situations, communication through conversations is important.
nn: I samband med måltidssituasjonar blir kommunikasjon gjennom samtalar viktig.

source: When teachers show care for the pupils and
nn: Når lærarar viser omsorg for elevane og

source: interpret and critically assess statistical representations from media
nn: tolke og kritisk vurdere statistiske framstillingar frå media og

source: The pupils must participate and
nn: Elevane skal både medverke og ta medansvar

source: The main subject area Physical Activity in Various Environments and Settings covers development and automation of natural basic movements in different indoor and outdoor environments.
nn: Hovudområdet aktivitet i ulike rørslemiljø omfattar utvikling og automatisering av naturlege, grunnleggjande rørsler i ulike miljø, både inne og ute.

source: discuss social and cultural conditions and values from a number of English-speaking countries
nn: planleggje, gjennomføre og vurdere turopplegg med kart og kompass som hjelpemiddel

source: School shall present knowledge and
nn: Skolen skal formidle kunnskap og fremje haldningar som sikrar

source: Pupils shall develop competence through a wide selection of play and different kinds of activities, develop versatility and learn to value exercise and visiting to nature.
nn: Elevane skal utvikle kompetanse gjennom eit breitt utval av leik og aktivitetsformer, utvikle allsidigheit og lære å praktisere og verdsetje ferdsel og opphald i naturen.

source: It also involves dealing with legal, cultural and ethical challenges related to Internet use.
nn: Det tyder òg å behandle juridiske, kulturelle og etiske utfordringar i samband med internettbruk.

source: explain how different interpretations of Norwegianness are expressed in key texts from the late 1700s to the 1870s and in a selection of contemporary texts
nn: gjere greie for korleis ulike førestellingar om det norske kjem til uttrykk i sentrale tekstar frå slutten av 1700-talet til 1870-åra og i eit utval av samtidstekstar

source: To interpret means to construct a perception or understanding of the meaning of a phenomenon, a practical situation or an artistic expression.
nn: Å tolke er å byggje opp ei oppfatning eller forståing av meiningsinnhaldet i eit fenomen, ein praktisk situasjon eller eit kunstnarisk uttrykk.

source: Law shall develop the ability to interpret and apply the law in both private and professional capacities, and stimulate reflection and critical thought.
nn: Rettslære skal utvikle evna til å tolke og bruke lovene både privat og i yrkeslivet og stimulere til refleksjon og kritisk tenking.

source: use digital tools to present work in the social sciences and comply with the rules for personal data protection and copyright
nn: bruke digitale verktøy til å presentere samfunnsfagleg arbeid og følgje reglar for personvern og opphavsrett

source: and school, between the different school levels along the learning path, and between school
nn: mellom barnehage og skole, dei ulike nivåa i opplæringsløpet og mellom skole og heim

source: They usually just walk around.’
nn: Dei går berre rundt omkring og sånn».

source: in Mathematics involves using digital tools to learn through play, exploration, visualisation and presentation.
nn: i matematikk handlar om å bruke slike verktøy til spel, utforsking, visualisering og publisering.

source: Apart from the animal sounds, it is almost completely quiet in the kindergarten this fine spring morning, even though there are no fewer than 93 children there.
nn: Bortsett frå dyrelydane er det nesten heilt stille i barnehagen, som i alt har 93 barn, denne vårmorgonen.

source: have hopes and ambitions for the future.
nn: historie med seg, og dei har håp og ambisjonar for framtida.

source: She was 16 when her parents bought the farm here on Jeløya Island.
nn: Da foreldra hennar kjøpte garden her på Jeløya, var ho 16 år.

source: Knowledge on the situation for indigenous peoples, minority peoples in the world in general and the Sami people in particular, is also part of the subject.
nn: I faget inngår kunnskap om situasjonen til urfolk og minoritetsfolk i verda generelt, og om situasjonen til samane som urfolk spesielt.

source: In addition to learning the English language, this subject will also contribute insight into the way we live and how others live, and their views on life, values and cultures.
nn: Faget skal gje erfaring i korleis ein kan øve opp god motorikk, styrke og uthald, og kunnskap om korleis ein kan unngå uheldige følgjer av fysisk aktivitet.

source: solve equations and inequalities through logical reasoning and explain
nn: løyse likningar og ulikskapar gjennom logiske resonnement og forklare

source: They also demonstrate and develop competence when using knowledge and skills to formulate and solve problems related to practical situations in everyday life and in society.
nn: Elevane viser og utviklar òg kompetanse når dei bruker kunnskap og ferdigheiter til å formulere og løyse problem som er knytte til praktiske situasjonar i kvardagen og i samfunnet.

source: In kindergarten, mathematics is play.
nn: I barne-hagen er matematikk ein leik.

source: play with others using different kinds of balls and participate in simple ball games
nn: avlevere, ta i mot og leike med ulike balltypar og vere med i enkle ballspel

source: Life skills refers to the ability to understand and influence
nn: Livsmeistring dreier seg om å kunne forstå og å kunne påverke faktorar som har

source: They also demonstrate and develop competence in mathematics when reasoning about and arguing for solutions and mathematical relationships.
nn: Vidare viser og utviklar dei kompetanse i matematikk når dei resonnerer over og argumenterer for matematiske samanhengar.

source: This leaves a social downside linked to experiences.
nn: Og det oppstår på den måten ei sosial slagside knytt til erfaringar.

source: on how people have fought and continue to fight for change in society while also having been and still being influenced by geographic conditions and historical contexts
nn: over korleis menneske har kjempa og kjempar for endringar i samfunnet og samstundes har vore og er påverka av geografiske forhold og historisk kontekst

source: ski and skate when conditions allow
nn: bruke ski og skøyter der det ligg til rette for det

source: Gloria and Sally proceed to work individually, but they soon leave the table to go play.
nn: Gloria og Sally fortset med arbeidet sitt individuelt, men etter kort tid går dei frå bordet og går for å leike.
